.. _bn_userguide:

BN Strings
============

Introduction
------------

The function :func:`clean_ca_bn() <dataprep.clean.clean_ca_bn.clean_ca_bn>` cleans a column containing Canadian Business Number (BN) strings, and standardizes them in a given format. The function :func:`validate_ca_bn() <dataprep.clean.clean_ca_bn.validate_ca_bn>` validates either a single BN strings, a column of BN strings or a DataFrame of BN strings, returning `True` if the value is valid, and `False` otherwise.

BN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "123026635"
* `standard`: BN strings with proper whitespace in the proper places. Note: in the case of BN, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_ca_bn()` and `validate_ca_bn()`.

### An example dataset containing BN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "bn": [
            "12302 6635",
            "12302 6635 RC 0001",
            "12345678Z",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                   bn                                           address
0          12302 6635                                     123 Pine Ave.
1  12302 6635 RC 0001                                           main st
2           12345678Z                      1234 west main heights 57033
3      51 824 753 556                    apt 1 789 s maple rd manhattan
4               hello                robie house, 789 north main street
5                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                NULL                                             hello

## 1. Default `clean_ca_bn`

By default, `clean_ca_bn` will clean bn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_ca_bn
clean_ca_bn(df, column = "bn")

,bn,address,bn_clean
0,12302 6635,123 Pine Ave.,123026635
1,12302 6635 RC 0001,main st,123026635RC0001
2,12345678Z,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_ca_bn(df, column = "bn", output_format="standard")

,bn,address,bn_clean
0,12302 6635,123 Pine Ave.,123026635
1,12302 6635 RC 0001,main st,123026635RC0001
2,12345678Z,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_ca_bn(df, column = "bn", output_format="compact")

,bn,address,bn_clean
0,12302 6635,123 Pine Ave.,123026635
1,12302 6635 RC 0001,main st,123026635RC0001
2,12345678Z,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned BN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_ca_bn(df, column="bn", inplace=True)

          bn_clean                                           address
0        123026635                                     123 Pine Ave.
1  123026635RC0001                                           main st
2              NaN                      1234 west main heights 57033
3              NaN                    apt 1 789 s maple rd manhattan
4              NaN                robie house, 789 north main street
5              NaN  (staples center) 1111 S Figueroa St, Los Angeles
6              NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_ca_bn(df, "bn", errors="coerce")

,bn,address,bn_clean
0,12302 6635,123 Pine Ave.,123026635
1,12302 6635 RC 0001,main st,123026635RC0001
2,12345678Z,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_ca_bn(df, "bn", errors="ignore")

,bn,address,bn_clean
0,12302 6635,123 Pine Ave.,123026635
1,12302 6635 RC 0001,main st,123026635RC0001
2,12345678Z,1234 west main heights 57033,12345678Z
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_ca_bn()`

`validate_ca_bn()` returns `True` when the input is a valid BN. Otherwise it returns `False`.

The input of `validate_ca_bn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_ca_bn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_ca_bn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_ca_bn
print(validate_ca_bn("12302 6635"))
print(validate_ca_bn("12302 6635 RC 0001"))
print(validate_ca_bn("12345678Z"))
print(validate_ca_bn("51 824 753 556"))
print(validate_ca_bn("hello"))
print(validate_ca_bn(np.nan))
print(validate_ca_bn("NULL"))

True
True
False
False
False
False
False

### Series

In [9]:
validate_ca_bn(df["bn"])

0     True
1     True
2    False
3    False
4    False
5    False
6    False
Name: bn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_ca_bn(df, column="bn")

0     True
1     True
2    False
3    False
4    False
5    False
6    False
Name: bn, dtype: bool

### Only DataFrame

In [11]:
validate_ca_bn(df)

      bn  address
0   True    False
1   True    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False